tutorials/cases/posterDemo-coldBed/0.orig/Ts
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ts;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

// Cold bed: the packed-bed cells are set to 600 K by setFields. The hot inlet
// (800 K solid boundary, 1000 K gas) heats the bed from below, building the
// vertical Ts gradient that makes Ychar — and hence sphere radii — vary with
// height.
internalField   uniform 600;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 800;
    }
    outlet
    {
        type            zeroGradient;
    }
    sideWalls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
